## Production: idp
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 4 to change, 16 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                        NAME                                        |
|----------|------------------------------------------------------------------------------------|
| delete   | `aws_secretsmanager_secret.zidatel_database_proxy_auth`                            |
|          | `aws_secretsmanager_secret_version.zidatel_database_proxy_auth`                    |
|          | `aws_ssm_parameter.zitadel_database_user_password`                                 |
|          | `aws_ssm_parameter.zitadel_database_user_username`                                 |
|          | `module.idp_database.aws_cloudwatch_log_group.proxy[0]`                            |
|          | `module.idp_database.aws_db_proxy.proxy[0]`                                        |
|          | `module.idp_database.aws_db_proxy_default_target_group.this[0]`                    |
|          | `module.idp_database.aws_db_proxy_target.target[0]`                                |
|          | `module.idp_database.aws_iam_policy.read_connection_string[0]`                     |
|          | `module.idp_database.aws_iam_role.rds_proxy[0]`                                    |
|          | `module.idp_database.aws_iam_role_policy_attachment.read_connection_string[0]`     |
|          | `module.idp_database.aws_secretsmanager_secret.connection_string[0]`               |
|          | `module.idp_database.aws_secretsmanager_secret.proxy_connection_string[0]`         |
|          | `module.idp_database.aws_secretsmanager_secret_version.connection_string[0]`       |
|          | `module.idp_database.aws_secretsmanager_secret_version.proxy_connection_string[0]` |
| update   | `aws_ssm_parameter.zitadel_database_host`                                          |
|          | `module.idp_database.aws_security_group.rds`                                       |
|          | `module.idp_ecs.aws_ecs_service.this`                                              |
|          | `module.idp_ecs.aws_iam_policy.this_task_exec`                                     |
| recreate | `module.idp_ecs.aws_ecs_task_definition.this`                                      |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/forms-terraform/actions/runs/17237894215).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.ecs_task_ssm_parameters will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "ecs_task_ssm_parameters" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ssm:GetParameter",
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ssm:ca-central-1:957818836222:parameter/idp_database_cluster_admin_password",
              + "arn:aws:ssm:ca-central-1:957818836222:parameter/idp_database_cluster_admin_username",
              + "arn:aws:ssm:ca-central-1:957818836222:parameter/zitadel_admin_password",
              + "arn:aws:ssm:ca-central-1:957818836222:parameter/zitadel_admin_username",
              + "arn:aws:ssm:ca-central-1:957818836222:parameter/zitadel_database_host",
              + "arn:aws:ssm:ca-central-1:957818836222:parameter/zitadel_database_name",
              + "arn:aws:ssm:ca-central-1:957818836222:parameter/zitadel_secret_key",
            ]
          + sid       = "GetSSMParameters"
        }
    }

  # aws_secretsmanager_secret.zidatel_database_proxy_auth will be destroyed
  # (because aws_secretsmanager_secret.zidatel_database_proxy_auth is not in configuration)
  - resource "aws_secretsmanager_secret" "zidatel_database_proxy_auth" {
      - arn                            = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:zidatel_database_proxy_auth-kaCOh5" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:zidatel_database_proxy_auth-kaCOh5" -> null
      - name                           = "zidatel_database_proxy_auth" -> null
      - recovery_window_in_days        = 30 -> null
      - region                         = "ca-central-1" -> null
      - tags                           = {
          - "CostCentre" = "forms-platform-production"
          - "Terraform"  = "true"
        } -> null
      - tags_all                       = {
          - "CostCentre" = "forms-platform-production"
          - "Terraform"  = "true"
        } -> null
        # (4 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret_version.zidatel_database_proxy_auth will be destroyed
  # (because aws_secretsmanager_secret_version.zidatel_database_proxy_auth is not in configuration)
  - resource "aws_secretsmanager_secret_version" "zidatel_database_proxy_auth" {
      - arn              = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:zidatel_database_proxy_auth-kaCOh5" -> null
      - id               = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:zidatel_database_proxy_auth-kaCOh5|terraform-20240913124337650300000006" -> null
      - region           = "ca-central-1" -> null
      - secret_id        = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:zidatel_database_proxy_auth-kaCOh5" -> null
      - secret_string    = (sensitive value) -> null
      - secret_string_wo = (write-only attribute) -> null
      - version_id       = "terraform-20240913124337650300000006" -> null
      - version_stages   = [
          - "AWSCURRENT",
        ] -> null
        # (1 unchanged attribute hidden)
    }

  # aws_ssm_parameter.zitadel_database_host will be updated in-place
  ~ resource "aws_ssm_parameter" "zitadel_database_host" {
        id              = "zitadel_database_host"
      + insecure_value  = (known after apply)
        name            = "zitadel_database_host"
        tags            = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
      ~ value           = (sensitive value)
      ~ version         = 1 -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_ssm_parameter.zitadel_database_user_password will be destroyed
  # (because aws_ssm_parameter.zitadel_database_user_password is not in configuration)
  - resource "aws_ssm_parameter" "zitadel_database_user_password" {
      - arn             = "arn:aws:ssm:ca-central-1:957818836222:parameter/zitadel_database_user_password" -> null
      - data_type       = "text" -> null
      - id              = "zitadel_database_user_password" -> null
      - key_id          = "alias/aws/ssm" -> null
      - name            = "zitadel_database_user_password" -> null
      - region          = "ca-central-1" -> null
      - tags            = {
          - "CostCentre" = "forms-platform-production"
          - "Terraform"  = "true"
        } -> null
      - tags_all        = {
          - "CostCentre" = "forms-platform-production"
          - "Terraform"  = "true"
        } -> null
      - tier            = "Standard" -> null
      - type            = "SecureString" -> null
      - value           = (sensitive value) -> null
      - value_wo        = (write-only attribute) -> null
      - version         = 1 -> null
        # (2 unchanged attributes hidden)
    }

  # aws_ssm_parameter.zitadel_database_user_username will be destroyed
  # (because aws_ssm_parameter.zitadel_database_user_username is not in configuration)
  - resource "aws_ssm_parameter" "zitadel_database_user_username" {
      - arn             = "arn:aws:ssm:ca-central-1:957818836222:parameter/zitadel_database_user_username" -> null
      - data_type       = "text" -> null
      - id              = "zitadel_database_user_username" -> null
      - key_id          = "alias/aws/ssm" -> null
      - name            = "zitadel_database_user_username" -> null
      - region          = "ca-central-1" -> null
      - tags            = {
          - "CostCentre" = "forms-platform-production"
          - "Terraform"  = "true"
        } -> null
      - tags_all        = {
          - "CostCentre" = "forms-platform-production"
          - "Terraform"  = "true"
        } -> null
      - tier            = "Standard" -> null
      - type            = "SecureString" -> null
      - value           = (sensitive value) -> null
      - value_wo        = (write-only attribute) -> null
      - version         = 1 -> null
        # (2 unchanged attributes hidden)
    }

  # module.idp_database.aws_cloudwatch_log_group.proxy[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_cloudwatch_log_group" "proxy" {
      - arn               = "arn:aws:logs:ca-central-1:957818836222:log-group:/aws/rds/proxy/idp-proxy" -> null
      - id                = "/aws/rds/proxy/idp-proxy" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/rds/proxy/idp-proxy" -> null
      - region            = "ca-central-1" -> null
      - retention_in_days = 14 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "CostCentre" = "forms-platform-production"
          - "Name"       = "idp_proxy_logs"
          - "Terraform"  = "true"
        } -> null
      - tags_all          = {
          - "CostCentre" = "forms-platform-production"
          - "Name"       = "idp_proxy_logs"
          - "Terraform"  = "true"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.idp_database.aws_db_proxy.proxy[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_db_proxy" "proxy" {
      - arn                    = "arn:aws:rds:ca-central-1:957818836222:db-proxy:prx-0d23de660dbdd6533" -> null
      - debug_logging          = false -> null
      - endpoint               = "idp-proxy.proxy-cuzmllmgzt4v.ca-central-1.rds.amazonaws.com" -> null
      - engine_family          = "POSTGRESQL" -> null
      - id                     = "idp-proxy" -> null
      - idle_client_timeout    = 1800 -> null
      - name                   = "idp-proxy" -> null
      - region                 = "ca-central-1" -> null
      - require_tls            = true -> null
      - role_arn               = "arn:aws:iam::957818836222:role/idp_rds_proxy" -> null
      - tags                   = {
          - "CostCentre" = "forms-platform-production"
          - "Name"       = "idp-rds-proxy"
          - "Terraform"  = "true"
        } -> null
      - tags_all               = {
          - "CostCentre" = "forms-platform-production"
          - "Name"       = "idp-rds-proxy"
          - "Terraform"  = "true"
        } -> null
      - vpc_security_group_ids = [
          - "sg-07c588b898b640c9d",
          - "sg-0c4a0e08ff8ea4a2c",
        ] -> null
      - vpc_subnet_ids         = [
          - "subnet-025adc92b0ee815ba",
          - "subnet-05b9cd59ad60e88af",
          - "subnet-066cf27132a20a02a",
        ] -> null

      - auth {
          - auth_scheme               = "SECRETS" -> null
          - client_password_auth_type = "POSTGRES_SCRAM_SHA_256" -> null
          - description               = "Additional proxy authentication" -> null
          - iam_auth                  = "DISABLED" -> null
          - secret_arn                = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:zidatel_database_proxy_auth-kaCOh5" -> null
            # (1 unchanged attribute hidden)
        }
      - auth {
          - auth_scheme               = "SECRETS" -> null
          - client_password_auth_type = "POSTGRES_SCRAM_SHA_256" -> null
          - description               = "The database connection string" -> null
          - iam_auth                  = "DISABLED" -> null
          - secret_arn                = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:idp-n9gxxn-njitxd" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.idp_database.aws_db_proxy_default_target_group.this[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_db_proxy_default_target_group" "this" {
      - arn           = "arn:aws:rds:ca-central-1:957818836222:target-group:prx-tg-0a56684deea01fe49" -> null
      - db_proxy_name = "idp-proxy" -> null
      - id            = "idp-proxy" -> null
      - name          = "default" -> null
      - region        = "ca-central-1" -> null

      - connection_pool_config {
          - connection_borrow_timeout    = 120 -> null
          - max_connections_percent      = 100 -> null
          - max_idle_connections_percent = 50 -> null
          - session_pinning_filters      = [] -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.idp_database.aws_db_proxy_target.target[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_db_proxy_target" "target" {
      - db_cluster_identifier = "idp-cluster" -> null
      - db_proxy_name         = "idp-proxy" -> null
      - id                    = "idp-proxy/default/TRACKED_CLUSTER/idp-cluster" -> null
      - port                  = 5432 -> null
      - rds_resource_id       = "idp-cluster" -> null
      - region                = "ca-central-1" -> null
      - target_group_name     = "default" -> null
      - type                  = "TRACKED_CLUSTER" -> null
        # (3 unchanged attributes hidden)
    }

  # module.idp_database.aws_iam_policy.read_connection_string[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_iam_policy" "read_connection_string" {
      - arn              = "arn:aws:iam::957818836222:policy/idpReadConnectionString" -> null
      - attachment_count = 1 -> null
      - id               = "arn:aws:iam::957818836222:policy/idpReadConnectionString" -> null
      - name             = "idpReadConnectionString" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "secretsmanager:ListSecretVersionIds",
                          - "secretsmanager:GetSecretValue",
                          - "secretsmanager:GetResourcePolicy",
                          - "secretsmanager:DescribeSecret",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:secretsmanager:ca-central-1:957818836222:secret:zidatel_database_proxy_auth-kaCOh5",
                          - "arn:aws:secretsmanager:ca-central-1:957818836222:secret:idp-n9gxxn-njitxd",
                        ]
                      - Sid      = "0"
                    },
                  - {
                      - Action   = "secretsmanager:ListSecrets"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "1"
                    },
                  - {
                      - Action    = "kms:Decrypt"
                      - Condition = {
                          - StringEquals = {
                              - "kms:ViaService" = "secretsmanager.ca-central-1.amazonaws.com"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "*"
                      - Sid       = "2"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPA56ATTST7DFFUZDG2Y" -> null
      - tags             = {
          - "CostCentre" = "forms-platform-production"
          - "Terraform"  = "true"
        } -> null
      - tags_all         = {
          - "CostCentre" = "forms-platform-production"
          - "Terraform"  = "true"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.idp_database.aws_iam_role.rds_proxy[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_iam_role" "rds_proxy" {
      - arn                   = "arn:aws:iam::957818836222:role/idp_rds_proxy" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "rds.amazonaws.com"
                        }
                      - Sid       = "RDSAssume"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2024-09-13T12:43:36Z" -> null
      - force_detach_policies = false -> null
      - id                    = "idp_rds_proxy" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::957818836222:policy/idpReadConnectionString",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "idp_rds_proxy" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "CostCentre" = "forms-platform-production"
          - "Terraform"  = "true"
        } -> null
      - tags_all              = {
          - "CostCentre" = "forms-platform-production"
          - "Terraform"  = "true"
        } -> null
      - unique_id             = "AROA56ATTST7E2C47HFTX" -> null
        # (3 unchanged attributes hidden)
    }

  # module.idp_database.aws_iam_role_policy_attachment.read_connection_string[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_iam_role_policy_attachment" "read_connection_string" {
      - id         = "idp_rds_proxy-20240913124418670100000008" -> null
      - policy_arn = "arn:aws:iam::957818836222:policy/idpReadConnectionString" -> null
      - role       = "idp_rds_proxy" -> null
    }

  # module.idp_database.aws_secretsmanager_secret.connection_string[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_secretsmanager_secret" "connection_string" {
      - arn                            = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:idp-n9gxxn-njitxd" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:idp-n9gxxn-njitxd" -> null
      - name                           = "idp-n9gxxn" -> null
      - recovery_window_in_days        = 30 -> null
      - region                         = "ca-central-1" -> null
      - tags                           = {
          - "CostCentre" = "forms-platform-production"
          - "Terraform"  = "true"
        } -> null
      - tags_all                       = {
          - "CostCentre" = "forms-platform-production"
          - "Terraform"  = "true"
        } -> null
        # (4 unchanged attributes hidden)
    }

  # module.idp_database.aws_secretsmanager_secret.proxy_connection_string[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_secretsmanager_secret" "proxy_connection_string" {
      - arn                            = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:idp-n9gxxn-proxy-connection-string-9p0KYh" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:idp-n9gxxn-proxy-connection-string-9p0KYh" -> null
      - name                           = "idp-n9gxxn-proxy-connection-string" -> null
      - recovery_window_in_days        = 30 -> null
      - region                         = "ca-central-1" -> null
      - tags                           = {
          - "CostCentre" = "forms-platform-production"
          - "Terraform"  = "true"
        } -> null
      - tags_all                       = {
          - "CostCentre" = "forms-platform-production"
          - "Terraform"  = "true"
        } -> null
        # (4 unchanged attributes hidden)
    }

  # module.idp_database.aws_secretsmanager_secret_version.connection_string[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_secretsmanager_secret_version" "connection_string" {
      - arn              = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:idp-n9gxxn-njitxd" -> null
      - id               = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:idp-n9gxxn-njitxd|terraform-20240913124337425700000005" -> null
      - region           = "ca-central-1" -> null
      - secret_id        = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:idp-n9gxxn-njitxd" -> null
      - secret_string    = (sensitive value) -> null
      - secret_string_wo = (write-only attribute) -> null
      - version_id       = "terraform-20240913124337425700000005" -> null
      - version_stages   = [
          - "AWSCURRENT",
        ] -> null
        # (1 unchanged attribute hidden)
    }

  # module.idp_database.aws_secretsmanager_secret_version.proxy_connection_string[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_secretsmanager_secret_version" "proxy_connection_string" {
      - arn              = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:idp-n9gxxn-proxy-connection-string-9p0KYh" -> null
      - id               = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:idp-n9gxxn-proxy-connection-string-9p0KYh|terraform-20240913124730201400000009" -> null
      - region           = "ca-central-1" -> null
      - secret_id        = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:idp-n9gxxn-proxy-connection-string-9p0KYh" -> null
      - secret_string    = (sensitive value) -> null
      - secret_string_wo = (write-only attribute) -> null
      - version_id       = "terraform-20240913124730201400000009" -> null
      - version_stages   = [
          - "AWSCURRENT",
        ] -> null
        # (1 unchanged attribute hidden)
    }

  # module.idp_database.aws_security_group.rds will be updated in-place
  ~ resource "aws_security_group" "rds" {
        id                     = "sg-0c4a0e08ff8ea4a2c"
        name                   = "idp_rds_proxy_sg"
      ~ tags                   = {
            "CostCentre" = "forms-platform-production"
          ~ "Name"       = "idp_rds_proxy_sg" -> "idp_rds_sg"
            "Terraform"  = "true"
        }
      ~ tags_all               = {
          ~ "Name"       = "idp_rds_proxy_sg" -> "idp_rds_sg"
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # module.idp_ecs.data.aws_ecs_task_definition.this_latest will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this_latest" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = (known after apply)
      + enable_fault_injection   = (known after apply)
      + ephemeral_storage        = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = (known after apply)
      + id                       = (known after apply)
      + ipc_mode                 = (known after apply)
      + memory                   = (known after apply)
      + network_mode             = (known after apply)
      + pid_mode                 = (known after apply)
      + placement_constraints    = (known after apply)
      + proxy_configuration      = (known after apply)
      + region                   = (known after apply)
      + requires_compatibilities = (known after apply)
      + revision                 = (known after apply)
      + runtime_platform         = (known after apply)
      + status                   = (known after apply)
      + task_definition          = "zitadel"
      + task_role_arn            = (known after apply)
      + volume                   = (known after apply)
    }

  # module.idp_ecs.data.aws_iam_policy_document.this_task_exec_combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this_task_exec_combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ecr:GetDownloadUrlForLayer",
                              + "ecr:GetAuthorizationToken",
                              + "ecr:BatchGetImage",
                              + "ecr:BatchCheckLayerAvailability",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = "logs:DescribeLogGroups"
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                      + {
                          + Action   = [
                              + "logs:PutLogEvents",
                              + "logs:DescribeLogStreams",
                              + "logs:CreateLogStream",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:logs:ca-central-1:957818836222:log-group:/aws/ecs/idp/zitadel:*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + (known after apply),
        ]
    }

  # module.idp_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:957818836222:service/idp/zitadel"
        name                               = "zitadel"
        tags                               = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "zitadel:30" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.idp_ecs.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:957818836222:task-definition/zitadel:30" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:957818836222:task-definition/zitadel" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                    name                   = "zitadel"
                  ~ secrets                = [
                        # (3 unchanged elements hidden)
                        {
                            name      = "ZITADEL_DATABASE_POSTGRES_HOST"
                            valueFrom = "arn:aws:ssm:ca-central-1:957818836222:parameter/zitadel_database_host"
                        },
                      ~ {
                            name      = "ZITADEL_DATABASE_POSTGRES_USER_PASSWORD"
                          ~ valueFrom = "arn:aws:ssm:ca-central-1:957818836222:parameter/zitadel_database_user_password" -> "arn:aws:ssm:ca-central-1:957818836222:parameter/idp_database_cluster_admin_password"
                        },
                      ~ {
                            name      = "ZITADEL_DATABASE_POSTGRES_USER_USERNAME"
                          ~ valueFrom = "arn:aws:ssm:ca-central-1:957818836222:parameter/zitadel_database_user_username" -> "arn:aws:ssm:ca-central-1:957818836222:parameter/idp_database_cluster_admin_username"
                        },
                        {
                            name      = "ZITADEL_FIRSTINSTANCE_ORG_HUMAN_PASSWORD"
                            valueFrom = "arn:aws:ssm:ca-central-1:957818836222:parameter/zitadel_admin_password"
                        },
                        # (2 unchanged elements hidden)
                    ]
                    # (11 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "zitadel" -> (known after apply)
      ~ revision                 = 30 -> (known after apply)
        tags                     = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.idp_ecs.aws_iam_policy.this_task_exec will be updated in-place
  ~ resource "aws_iam_policy" "this_task_exec" {
        id               = "arn:aws:iam::957818836222:policy/zitadel_ecs_task_exec_policy"
        name             = "zitadel_ecs_task_exec_policy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:GetAuthorizationToken",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "logs:DescribeLogGroups"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:DescribeLogStreams",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:957818836222:log-group:/aws/ecs/idp/zitadel:*"
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:GetParameter",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:957818836222:parameter/zitadel_secret_key",
                          - "arn:aws:ssm:ca-central-1:957818836222:parameter/zitadel_database_user_username",
                          - "arn:aws:ssm:ca-central-1:957818836222:parameter/zitadel_database_user_password",
                          - "arn:aws:ssm:ca-central-1:957818836222:parameter/zitadel_database_name",
                          - "arn:aws:ssm:ca-central-1:957818836222:parameter/zitadel_database_host",
                          - "arn:aws:ssm:ca-central-1:957818836222:parameter/zitadel_admin_username",
                          - "arn:aws:ssm:ca-central-1:957818836222:parameter/zitadel_admin_password",
                          - "arn:aws:ssm:ca-central-1:957818836222:parameter/idp_database_cluster_admin_username",
                          - "arn:aws:ssm:ca-central-1:957818836222:parameter/idp_database_cluster_admin_password",
                        ]
                      - Sid      = "GetSSMParameters"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 4 to...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener_rule.idp_protocol_version"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.idp_send_email"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.idp_send_email"]
WARN - plan.json - main - Missing Common Tags: ["aws_shield_protection.idp"]

23 tests, 19 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
